# Pandas for AI

Pandas Series

In [ ]:
import pandas as pd

In [ ]:
obj = pd.Series([1,2,3,4,5,6]) #by using python list
print(obj)

In [ ]:
sales = pd.Series([100, 2000, 3000])
print(sales.values) #its returned values of series
print(sales.index) #its returned index of series

In [ ]:
obj2 = pd.Series([1,2,3,4,5,6], index = ("a", "b","c", "d", "e", "f")) #you can change the type of index according to yourself
print(obj2)

In [ ]:
sales = pd.Series([100, 2000, 3000], index = ("mon", "tus", "wed"), name="sales of threee days" )
print(sales)

Practice Gothrough

In [ ]:
sw = pd.Series([10, 12, 11, 23, 34, 45, 0 ], index= ['mod', 'tue', 'wed', 'thu', 'fri', 'sat', 'sun'])
print(sw)

# indexing

In [ ]:
print(sw[1])

In [ ]:
print(sw['tue'])

# slicing

In [ ]:
print(sw[[3,5]]) #with index position

print(sw[["wed","sun"]]) #with index names

In [ ]:
print(sw[sw < 20 ]) #conditional slicing

In [ ]:
sw*2 #it can't effect the original one untill we store it in new var

In [ ]:
sw

In [ ]:
sw = sw*3

In [ ]:
sw

In [ ]:
"sun" in sw # how you can check value in any series using index

In [ ]:
# how to make series using numpy array

import numpy as np
arr = np.arange(5)
irr = np.array(['a', 'b', 'c', 'd', 'e'])
series_from_nparray = pd.Series( arr, index = irr )

In [ ]:
print(series_from_nparray)

In [ ]:
#how to make series using python dictionary

sub_scr = {'phy':65, 'chem':78, 'math':95, 'eng':77}
scr_in_series = pd.Series(sub_scr)

In [ ]:
scr_in_series

In [ ]:
scr_in_series.index #you can check the index of series

In [ ]:
#you can sort or update by your index from the dictionary
scr_in_series = pd.Series(sub_scr, index= ['math', 'chem', 'phy'])

In [ ]:
scr_in_series

**soursce of input data for series**
* direct data in the series method
* from numpy array
* from python list
* from python dictionary

In [ ]:
# example of data from python list
l1 = ['heloo', 'world']
l2 = [1,2]
ser = pd.Series(l1, index= l2)
print(ser)

In [ ]:
#you can identify the null value in series, here urdu is not defiend in dictionary
sub_scr = {'phy':65, 'chem':78, 'math':95, 'eng':77}
scr_in_series = pd.Series(sub_scr, index= ['math', 'chem', 'phy', 'urdu'])

In [ ]:
scr_in_series #NaN stand for * not a number *

In [ ]:
# how to check null value using Function
pd.isnull(scr_in_series)

In [ ]:
# how to check null value using method
scr_in_series.isnull()

In [ ]:
# how to name series and index of series

scr_in_series.name = "number of subjects"
scr_in_series.index.name = 'name of subject'

In [ ]:
scr_in_series

In [ ]:
scr_in_series.index

# DATA FRAME

In [ ]:
# data frame is used for  multi dimensional data

In [ ]:
import pandas as pd

In [ ]:
ser1 = pd.Series([1,2,3,4,5])
ser2 = pd.Series([6,7,8,9,0])

full_name = {"first": ser1, "last": ser2}
df = pd.DataFrame(full_name)

In [ ]:
df

In [ ]:
full_name = {"first": [1,2,3,4,5], "last": [6,7,8,9,0]}
df = pd.DataFrame(full_name, index = ['a', 'b', 'c', 'd', 'e'])
print(df)

In [ ]:
full_name = {"first": [1,2,3,4,5], "last": [6,7,8,9,0]} #default index
df = pd.DataFrame(full_name)
print(df)

In [ ]:
py_list = [1,2,3,4,5]
i_dx = ['a', 'b', 'c', 'd' , 'e' ]
full_name = {"first": py_list, "last": [6,7,8,9,0] }
df = pd.DataFrame(full_name, index= i_dx)
print(df)

# .head() function

any_df_name.head() # it will show top 5 position

In [ ]:
st = [1,2,3,4,5,6,7,8,9]
i_dx = ['a', 'b', 'c', 'd' , 'e','f','g','h','i']
full_name = {"first": st, "last": [6,7,8,9,0,1,2,3,4] }
df = pd.DataFrame(full_name, index= i_dx)
print(df)

In [ ]:
df.head()

re-arrangment of collums

In [ ]:
#letsmake lists
name = ['ali', 'ahmed', 'talha','baber', 'nomi']
classs = ['1st year', '2st year', '1st year', '3st year', '3st year',  ]
roll_no = [12,13,14,15,16]

In [ ]:
#lets
data = {'name': name, "class": classs, 'roll_no': roll_no}

In [ ]:
pd.DataFrame(data, index = ['a', 'b', 'c', 'd' , 'e'])

In [ ]:
#lets rearrange columns

pd.DataFrame(data, columns = ['roll_no', 'name', 'class'])

In [ ]:
pd.DataFrame(data, columns = ['roll_no', 'class', 'name'])

In [ ]:
#lets add extra column
pd.DataFrame(data, columns = ['roll_no', 'class', 'name', 'age'])

In [ ]:
#how to index these valuse
pd.DataFrame(data, columns = ['roll_no', 'class', 'name', 'age'], index =  ['a', 'b', 'c', 'd' , 'e'])

In [ ]:

new_df = pd.DataFrame(data, columns = ['roll_no', 'age', 'class', 'name'], index =  ['i', 'ii', 'iii', 'iv' , 'v'])
new_df

In [ ]:
# how to call colums in data frame

##print(new_df.columns)
print(new_df.index)

In [ ]:
# how to access or extract data from dataFram

# A column in a dataFrame can be retrieved as a Seies either by dict-lie notation or by attribute:

# dictionary-like notation
##full_name = {"first": st, "last": [6,7,8,9,0,1,2,3,4] }
##print(full_name)

#now dic-like notation
##full_name["last"]

#now dic-like notation for dataFrame to extract data of columns of dataFrame
print(new_df)
new_df["name"]

In [ ]:
# there is another method, attribute style of accessing dataFrame data

new_df.roll_no # dataFrame_name.ColumnName

In [ ]:
# accessing index or row data 

new_df.loc['iii'] #index name provide here

In [ ]:
#how can we update a column

one = ["ali", "ahmed", "awan", 'lal']
two = (3,4,5,6)
new = {"one": one, "two": two}
three_df = pd.DataFrame(new,columns= [ "one", "two", "three"], index = ['i','ii','iii', 'iv'])

In [ ]:
three_df

In [ ]:
# its time to update three (column)

three_df.three = "hello"
print(three_df)

three_df['three'] = "he"
print(three_df)

In [ ]:
for_three = ["one_hello", "two_hello", "three hello", "four hello"]
for_three

In [ ]:

three_df.three = for_three

print(three_df)
print()
three_df["three"] = for_three
print(three_df)

In [ ]:
#how to check the length of dataFrame (rows or index)
len(three_df)

# Function Application and Mapping

In [ ]:
import pandas as pd

In [ ]:
day = [12,13,14,15]
month = ['jan', 'fab','mar','apr']
d_m = {'day': day, 'mon': month}
dm_df = pd.DataFrame(d_m, index= ['i','ii','iii','iv'])

fun = lambda x : x.max - x.min

#apply_fun = dm_df.apply(fun)

In [ ]:
dm_df

# Sorting and Ranking

In [ ]:
import numpy as np
import pandas as pd
fram = pd.DataFrame(np.arange(2*3).reshape((2,3)),index = ['b','a'], columns= ['iii','i','ii'])
fram

In [ ]:
fram.sort_index() # default in sort, axis=0 and ascending=true

In [ ]:
fram.sort_index(axis=1, ascending=False)

In [ ]:
fram.sort_index(axis=1, ascending=True)

In [ ]:
fram.sort_index(axis=0, ascending=False)

In [ ]:
fram.sort_index(axis=0, ascending=True)

# sort by values

In [ ]:
import pandas as pd
print(fram)
#fram.sort_values(by= 'b')

In [ ]:
fram.rank(ascending = False,method = "max")

In [ ]:
fram.rank(ascending = False,method = "min")

# Sumarizing and computing Descriputing Statistic

In [ ]:
print(fram)

In [ ]:
fram.sum()

In [ ]:
print(fram)
fram.sum(axis='columns')

In [ ]:
print(fram)
print(fram.mean(axis='columns', skipna=False))
print(fram.mean(axis='columns'))

Unique Value

In [ ]:
a = pd.DataFrame([[1,2,3,4,5],
                  [1,3,4,5,6,],
                  [1,2,4,5,6,],
                  [2,1,3,4,5],
], index=['a','b','c','d'], columns=['i','ii','iii','iv','v'])
print(e)

In [ ]:
a['i'].unique(), a['iii'].unique()

In [ ]:
a['i'].value_counts(), a['ii'].value_counts()

loc vs iloc # location
loc use for labels and iloc use for numbers

In [ ]:
print(a)
a.loc['b']

In [ ]:
a.loc['b', 'ii']

In [ ]:
a.loc[['a','b'],['ii','iv']]

In [ ]:
a.iloc[1,3]

In [ ]:
a.iloc[[1,3],[2,4]]

In [ ]:
a.iloc[:] # : is use for whole data fram

In [ ]:
a.iloc[:, :2] # whole rows and o,1 columns caz 2 is exclusive

# Arithmetic & Data Alignment

In [ ]:
import numpy as np
df1 = pd.DataFrame(np.arange(3*3).reshape(3,3),
                  index=['a','b','c'],
                  columns=['i','ii','iii'])
df2 = pd.DataFrame(np.arange(3*4).reshape(3,4), 
                  index=['b','c','a'],
                  columns=['ii','iii','i','iv'])

In [ ]:
print(df1)
print()
print(df2)

In [ ]:
df3 = df1+df2
df3

In [ ]:
print(df1)
print()
print(df2)

df3

Arithmetic Methods with Fill Values

In [ ]:
print(df1)
print()
print(df2)

df4 = df1.add(df2, fill_value = 0)
df4

In [ ]:
print(df3)
print(df4)

Operation between DataFram and Series

In [ ]:
sr = pd.Series([3,4,5], index= ['i','ii','iii'])
print(df4)
print(sr)

In [ ]:
df4 - sr

# Deleting Data

In [ ]:
print(df1)
print()
print(df2)

df4 = df1.add(df2, fill_value = 0)
df4

In [ ]:

df4

In [ ]:
df4 = df4.drop('iii', axis = 1)
print(df4)

In [ ]:
df4.drop('ii', axis = 1, inplace = True)
df4

In [ ]:
df4.drop('b', axis = 0, inplace = True)
df4 # Deleting rows

# Indexing, Selection and Filtering

In [ ]:
df4 = df1.add(df2, fill_value = 0)
df4

In [ ]:
print(df4[['i','iii']])

In [ ]:
df4[ :2]

Reindex Method

In [ ]:
import pandas as pd
src = pd.Series(['ali','ahmed','talha'], index= [4,7,3])
src

In [ ]:
src.reindex(range(8))

In [ ]:
src.reindex(range(3,11))

In [ ]:
abc = src.reindex(range(3,11))

In [ ]:
abc

In [ ]:
import numpy as np
import pandas as pd
df1 = pd.DataFrame(np.arange(3*3).reshape(3,3),
                  index=['a','b','c'],
                  columns=['i','ii','iii'])
df2 = pd.DataFrame(np.arange(3*4).reshape(3,4), 
                  index=['b','c','a'],
                  columns=['ii','iii','i','iv'])
df4 = df1.add(df2, fill_value = 0)
df4

In [ ]:
df4.reindex(columns = ['ii','iii','i','iv','v'], method = 'ffill')

In [ ]:
df4.reindex(['a','b','c','d','e'], method = 'ffill')

In [ ]:
df4

Accessing Data

In [ ]:
df4.i

In [ ]:
df4.i[:2]

In [ ]:
df4['i'][:2]

Conditional filtring

In [ ]:
print(df4)
df4[df4['iv']<8]

# Selection with Loc and iloc

In [ ]:
import numpy as np
import pandas as pd
df1 = pd.DataFrame(np.arange(3*3).reshape(3,3),
                  index=['a','b','c'],
                  columns=['i','ii','iii'])
df2 = pd.DataFrame(np.arange(3*4).reshape(3,4), 
                  index=['b','c','a'],
                  columns=['ii','iii','i','iv'])
df5 = df1.add(df2, fill_value = 0)
df5

In [ ]:
df5.loc[['b'],['ii','iii']] #labels of rows and coulmns

In [ ]:
df5.iloc[[1],[1,2]] # number of indexis

In [ ]:
df5.iloc[[1],[2,3,1]]

In [ ]:
df5.iloc[:2, :2] # firstly rows then columns

In [ ]:
df5.iloc[:2] # its apply on rows

In [ ]:
df5.iloc[:, :2] # if we want apply filter on columns

# Section 3 " Data Loading, Storage, and File Formats"

# Common Options

data type: csv, html and xls

# Loading Data from CSV File

In [ ]:
import numpy as np
import pandas as pd

dataLoad = pd.read_csv('examples/ex1.csv')
dataLoad

In [ ]:
dataLoad1 = pd.read_csv('examples/sample.csv')
dataLoad1

In [ ]:
# how to change column names while loading data

dataLoad2 = pd.read_csv('examples/sample.csv',
                       names = ['id','name','ch','phy','eng','math'])
dataLoad2

In [ ]:
"""how to remove default column, which is 
loaded from file"""

dataLoad3 = pd.read_csv('examples/sample.csv',
                        skiprows = 1,
                       names = ['id','name','ch'
                                ,'phy','eng',
                                'math'])
dataLoad3

In [ ]:
"""if we want to use 1st line as data, then we use 'header= None'"""

dataLoad3 = pd.read_csv('examples/sample.csv',
                        header = None,
                       names = ['id','name','ch'
                                ,'phy','eng',
                                'math'])
dataLoad3

# Hierarchical Index

In [ ]:
"""if we want to use 1st column as index, then we use 'index_col=[]'"""

dataLoad3 = pd.read_csv('examples/sample.csv',
                        index_col=['id'],
                       names = ['id','name','ch'
                                ,'phy','eng',
                                'math'])
dataLoad3

In [ ]:
"""we can use multiple columns as index, then we use 'index_col=['col1', 'col2']'"""

dataLoad3 = pd.read_csv('examples/sample.csv',
                index_col=['sec','id','name'],
                       names = ['id','name','ch'
                                ,'phy','eng',
                                'math', 'sec'])
dataLoad3

# Handling Missing Values

 na_values = dictionary nmae

In [ ]:
dataLoad4 = pd.read_csv('examples/sample3.csv')

print(dataLoad4)
print()
sentinels = {'message': ['foo', 'Na']}

dataLoad4 = pd.read_csv('examples/sample3.csv',
                       na_values = sentinels)

print(dataLoad4)

# Reading and Text Files

In [ ]:
import pandas as pd
ds = pd.read_csv('examples/ex3.txt')
print(ds)
ds = pd.read_csv('examples/ex3.txt', sep = '\s+')
ds

In [ ]:
ds = pd.read_csv('datasets/train.csv', nrows = 7)
ds

In [ ]:
Continue from video 7

read data in chunks

In [ ]:
ds_chunks = pd.read_csv('datasets/train.csv', chunksize = 200)
ds_chunks

for chunk in ds_chunks:
    print(chunk.head)

In [ ]:
chunkList = []
chunkList.append(chunk)
chunkList[0]

# Writing Data to Text formate

In [ ]:
# .to_save()

In [ ]:
import numpy as np
import pandas as pd

dates = pd.date_range('1/1/2001', periods=5)
sr = pd.Series(np.arange(5), index = dates)
sr.to_csv('examples/newSeries.csv')

In [ ]:
pd.read_csv('examples/newSeries.csv', skiprows = 1)

# Working with Delimited formats

In [ ]:
import csv

f = open('examples/ex7.csv')
reader = csv.reader(f)
for line in reader:
    print(line)

# JSON data

In [ ]:
data = pd.read_json('examples/example.json')
data

# Web Data Loading

XML and HTML: web data loading into datafram

In [ ]:
import pandas as pd

tables = pd.read_html(
    'examples/fdic_failed_bank_list.html')
tables

In [ ]:
print(type(tables))

In [ ]:
print(len(tables))

In [ ]:
tables[0]

In [ ]:
failures_bank_df= tables[0]

In [ ]:
failures_bank_df

In [ ]:
type(failures_bank_df)

In [ ]:
failures_bank_df.shape #shape

In [ ]:
failures_bank_df.columns # how to checkcolumns of df

In [ ]:
len(failures_bank_df)

In [ ]:
failures_bank_df['City'].head()

In [ ]:
failures_bank_df.City.head()

In [ ]:
failures_bank_df['Bank Name'].head()

In [ ]:
failures_bank_df.head()

# Convert string date to date time

In [ ]:
time = pd.to_datetime(failures_bank_df['Closing Date'])

In [ ]:
time

In [ ]:
type(failures_bank_df)

# Binary Data Format

In [ ]:
fram = pd.read_csv('examples/ex1.csv')
print(fram)
fram.to_pickle('examples/fram_new_pickle')
new = pd.read_pickle('examples/fram_new_pickle')

In [ ]:
print(new)

# Using HDF Format (not completed)

hararical data format

In [ ]:
import numpy as np
import pandas as pd

fram1 = pd.DataFrame({'a': np.random.randn(100)})
store = pd.HDFStore('mydata.h5')
store['obj1'] = fram1

In [ ]:
store['obj1']

In [ ]:
store.obj1

In [ ]:
x = store.obj1
x

In [ ]:
type(x)

In [ ]:
len(x)

In [ ]:
x.head()

# Reading Microsoft Excel Data

In [ ]:
#reading
xlxs = pd.ExcelFile('examples/ex1.xlsx')
fram = pd.read_excel('examples/ex1.xlsx', 'Sheet1')

In [ ]:
#writing
writer = pd.ExcelWriter('examples/ex2.xlsx')
fram.to_excel(writer, 'Sheet1')
writer.save()

In [ ]:
#alternative option for single sheet
fram.to_excel('examples/ex2.xlsx')

# Working with web APIs

In [ ]:
import requests
import numpy as np


url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
print(resp)

In [ ]:
data = resp.json() #conveting data to json format

In [ ]:
data

In [ ]:
type(data)

In [ ]:
data_dict = data[0]
#data_dict

In [ ]:
#data_dict['title']

In [ ]:
issues = pd.DataFrame(data)

In [ ]:
issues.head()

In [ ]:
issues = pd.DataFrame(data, columns = ['title' , 'id' , 'number' , 'milestone' , 'comments' ])

In [ ]:
issues.head()

# Working with Databases

# Handling Missing Data

In [8]:
import pandas as pd
from numpy import nan as NA

data = pd.DataFrame([[1,2,3], [1, NA, NA],
                    [NA, NA, NA], [NA, 6, 3]],
                   columns =list('abc'))
display(data)

     a    b    c
0  1.0  2.0  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  3.0

In [12]:
#differance b/w dropna and dropna(how='all')
display(data)

clean = data.dropna() 
display(clean)

clean = data.dropna(how='all') 
display(clean)

     a    b    c
0  1.0  2.0  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  3.0

     a    b    c
0  1.0  2.0  3.0

     a    b    c
0  1.0  2.0  3.0
1  1.0  NaN  NaN
3  NaN  6.0  3.0

In [13]:
display(data)

clean = data.dropna(axis = 1) 
display(clean)

clean = data.dropna(axis = 1, how='all') 
display(clean)

     a    b    c
0  1.0  2.0  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  3.0

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

     a    b    c
0  1.0  2.0  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  3.0

# Filling Missing Data

In [14]:
import pandas as pd
from numpy import nan as NA
import numpy as np

data = pd.DataFrame([[1,2,3], [1, NA, NA],
                    [NA, NA, NA], [NA, 6, 3]],
                   columns =list('abc'))
display(data)

     a    b    c
0  1.0  2.0  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  3.0

In [15]:
data.fillna(333)

       a      b      c
0    1.0    2.0    3.0
1    1.0  333.0  333.0
2  333.0  333.0  333.0
3  333.0    6.0    3.0

In [22]:
data = data.fillna({'a':11, 'b':33, 'c':444})
#here "a", "b","c" are the columns of datafram
data = pd.DataFrame([[1,2,3], [1, NA, NA],
                    [NA, NA, NA], [NA, 6, 3]],
                   columns =list('abc'))display(data)

      a     b      c
0   1.0   2.0    3.0
1   1.0  33.0  444.0
2  11.0  33.0  444.0
3  11.0   6.0    3.0

In [28]:
#using of method = 'ffill' with 'fillna'
data = pd.DataFrame([[1,2,3], [5, NA, NA],
                    [NA, NA, NA], [NA, 6, 4]],
                   columns =list('abc'))
display(data)
data = data.fillna(method = 'ffill')
display(data)

     a    b    c
0  1.0  2.0  3.0
1  5.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  4.0

     a    b    c
0  1.0  2.0  3.0
1  5.0  2.0  3.0
2  5.0  2.0  3.0
3  5.0  6.0  4.0

# Removing Duplicates

In [32]:
import pandas as pd
from numpy import nan as NA
import numpy as np

data = pd.DataFrame([[1,2,3], [1, NA, NA],
                    [NA, NA, NA], [NA, 6, 3]],
                   columns =list('abc'))
data = data.fillna(method = 'ffill')
display(data)
data.duplicated()

     a    b    c
0  1.0  2.0  3.0
1  1.0  2.0  3.0
2  1.0  2.0  3.0
3  1.0  6.0  3.0

0    False
1     True
2     True
3    False
dtype: bool

In [35]:
data = data.drop_duplicates()
data

     a    b    c
0  1.0  2.0  3.0
3  1.0  6.0  3.0

In [44]:
data = pd.DataFrame([[1,2,1], [1, 3, 2],
                    [3, 2, 3], [2, 6, 2]],
                   columns =list('abc'))

display(data)

   a  b  c
0  1  2  1
1  1  3  2
2  3  2  3
3  2  6  2

In [46]:
data = data.drop_duplicates(['a', 'c'])
display(data)

   a  b  c
0  1  2  1
1  1  3  2
2  3  2  3
3  2  6  2

# Replacing Values

In [1]:
import pandas as pd
from numpy import nan as NA
import numpy as np

data = pd.DataFrame([[1,2,3], [1, NA, NA],
                    [NA, NA, NA], [NA, 6, 3]],
                   columns =list('abc'))
data = data.fillna(method = 'ffill')
display(data)

data = data.replace(np.nan, 55)

display(data)

     a    b    c
0  1.0  2.0  3.0
1  1.0  2.0  3.0
2  1.0  2.0  3.0
3  1.0  6.0  3.0

     a    b    c
0  1.0  2.0  3.0
1  1.0  2.0  3.0
2  1.0  2.0  3.0
3  1.0  6.0  3.0

In [3]:
import pandas as pd
from numpy import nan as NA
import numpy as np

data = pd.DataFrame([[1,2,3], [1, NA, NA],
                    [NA, NA, NA], [NA, 6, 3]],
                   columns =list('abc'))
#data = data.fillna(method = 'ffill')
display(data)

data = data.replace([np.nan, 1], [4,7])

display(data)

     a    b    c
0  1.0  2.0  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  3.0

     a    b    c
0  7.0  2.0  3.0
1  7.0  4.0  4.0
2  4.0  4.0  4.0
3  4.0  6.0  3.0

# Renaming Indexes

In [8]:
import pandas as pd
from numpy import nan as NA
import numpy as np

data = pd.DataFrame([[1,2,3], [1, 3, 1],
                    [3, 2, 1], [2, 6, 3]],
                   columns =list('abc'), 
                   index = list('abcd'))
data

   a  b  c
a  1  2  3
b  1  3  1
c  3  2  1
d  2  6  3

In [16]:
new = lambda x: x[:4].upper()
data = data.index.map(new)
data

AttributeError: 'Index' object has no attribute 'Index'

# Detecting Filtering Outliers

In [18]:
import pandas as pd
from numpy import nan as NA
import numpy as np

data = pd.DataFrame(np.arange(10*10).reshape(10,10))
data

    0   1   2   3   4   5   6   7   8   9
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89
9  90  91  92  93  94  95  96  97  98  99

In [22]:
# use of ".describe()" function

data.describe()

,0,1,2,3,4,5,6,7,8,9
count,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000
mean,45.000000,46.000000,47.000000,48.000000,49.000000,50.000000,51.000000,52.000000,53.000000,54.000000
std,30.276504,30.276504,30.276504,30.276504,30.276504,30.276504,30.276504,30.276504,30.276504,30.276504
min,0.000000,1.000000,2.000000,3.000000,4.000000,5.000000,6.000000,7.000000,8.000000,9.000000
25%,22.500000,23.500000,24.500000,25.500000,26.500000,27.500000,28.500000,29.500000,30.500000,31.500000
50%,45.000000,46.000000,47.000000,48.000000,49.000000,50.000000,51.000000,52.000000,53.000000,54.000000
75%,67.500000,68.500000,69.500000,70.500000,71.500000,72.500000,73.500000,74.500000,75.500000,76.500000
max,90.000000,91.000000,92.000000,93.000000,94.000000,95.000000,96.000000,97.000000,98.000000,99.000000

In [23]:
outliers = data[(np.abs(data)>3).any(1)]

In [25]:
print(len(outliers), len(data))

10 10

# Permutation & Random Sampling

In [26]:
import pandas as pd
from numpy import nan as NA
import numpy as np

data = pd.DataFrame(np.arange(5*5).reshape(5,5))
data

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [33]:
sampler = np.random.permutation(5)
data[sampler]

data

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

# Regular Expression & Vectorized Function

# Hierarchical Indexing

In [44]:
import pandas as pd
import numpy as np

data = pd.Series(np.arange(8),
                index = [['a','a','a','b','c','c','d','d'],[1,2,3,1,1,2,1,2]])
display(data)

a  1    0
   2    1
   3    2
b  1    3
c  1    4
   2    5
d  1    6
   2    7
dtype: int32

In [45]:
data['a']

1    0
2    1
3    2
dtype: int32

In [46]:
data['b']

1    3
dtype: int32

In [49]:
data[['a', 'c']]

a  1    0
   2    1
   3    2
c  1    4
   2    5
dtype: int32

In [52]:
# i csn access inner level of index, which will select all upper indexis at level 2
display(data)
display(data[:, 1])
# we can use loc functon as well
display(data.loc[:, 1])

a  1    0
   2    1
   3    2
b  1    3
c  1    4
   2    5
d  1    6
   2    7
dtype: int32

a    0
b    3
c    4
d    6
dtype: int32

a    0
b    3
c    4
d    6
dtype: int32

In [58]:
import pandas as pd
import numpy as np

data = pd.Series(np.arange(8),
                index = [['a','a','a','b','c','c','d','d'],[1,2,3,1,1,2,1,2]])
display(data)

data = data.unstack()

display(data)

a  1    0
   2    1
   3    2
b  1    3
c  1    4
   2    5
d  1    6
   2    7
dtype: int32

     1    2    3
a  0.0  1.0  2.0
b  3.0  NaN  NaN
c  4.0  5.0  NaN
d  6.0  7.0  NaN

In [59]:
data

     1    2    3
a  0.0  1.0  2.0
b  3.0  NaN  NaN
c  4.0  5.0  NaN
d  6.0  7.0  NaN

In [60]:
#from pivot style to hireracal style
data.stack()

a  1    0.0
   2    1.0
   3    2.0
b  1    3.0
c  1    4.0
   2    5.0
d  1    6.0
   2    7.0
dtype: float64

In [77]:
import pandas as pd
import numpy as np

data = pd.DataFrame(np.arange(4*4).reshape(4,4),
                   index = [['a','a','b','b'], [1,2,1,2]],
                   columns = [['pak', 'pak', 'ind', 'ind'],
                             ['green', 'green', 'orange', 'orange']])

data.index.names=['key1','key2']
data.columns.names=['country', 'flag']

In [78]:
data

country     pak          ind
flag      green green orange orange
key1 key2
a    1        0     1      2      3
     2        4     5      6      7
b    1        8     9     10     11
     2       12    13     14     15

In [79]:
data['pak']

flag       green  green
key1 key2
a    1         0      1
     2         4      5
b    1         8      9
     2        12     13

# swaplevel

In [80]:
data.swaplevel('key1','key2') #chaning keys

country     pak          ind
flag      green green orange orange
key2 key1
1    a        0     1      2      3
2    a        4     5      6      7
1    b        8     9     10     11
2    b       12    13     14     15

# sort_index

In [82]:
data.sort_index(level=1)

country     pak          ind
flag      green green orange orange
key1 key2
a    1        0     1      2      3
b    1        8     9     10     11
a    2        4     5      6      7
b    2       12    13     14     15

In [85]:
data = data.swaplevel('key1','key2')
display(data)
data = data.sort_index(level=1)
data

country     pak          ind
flag      green green orange orange
key2 key1
1    a        0     1      2      3
     b        8     9     10     11
2    a        4     5      6      7
     b       12    13     14     15

country     pak          ind
flag      green green orange orange
key2 key1
1    a        0     1      2      3
2    a        4     5      6      7
1    b        8     9     10     11
2    b       12    13     14     15

In [87]:
data = data.swaplevel('key1','key2').sort_index(level=0)
display(data)

country     pak          ind
flag      green green orange orange
key2 key1
1    a        0     1      2      3
     b        8     9     10     11
2    a        4     5      6      7
     b       12    13     14     15

# Summary Statistics by Level

In [92]:
display(data)
display(data.sum(level='key2'))
data.sum(level='flag', axis = 1)

country     pak          ind
flag      green green orange orange
key2 key1
1    a        0     1      2      3
     b        8     9     10     11
2    a        4     5      6      7
     b       12    13     14     15

country   pak          ind
flag    green green orange orange
key2
1           8    10     12     14
2          16    18     20     22

flag       green  orange
key2 key1
1    a         1       5
     b        17      21
2    a         9      13
     b        25      29

# indexing with datafram column

In [97]:
data = pd.DataFrame({'a':[1,2,3,4,5],
                     'b':['a','a','a','b','b'],
                    'c':[1,2,3,1,2],
                     'd':['talha','ali','ahmed','moni','baber']})
data

   a  b  c      d
0  1  a  1  talha
1  2  a  2    ali
2  3  a  3  ahmed
3  4  b  1   moni
4  5  b  2  baber

In [99]:
data.set_index(['b','c'])

     a      d
b c
a 1  1  talha
  2  2    ali
  3  3  ahmed
b 1  4   moni
  2  5  baber

In [100]:
# use of drop = false in set_index()
data.set_index(['b','c'], drop = False)

     a  b  c      d
b c
a 1  1  a  1  talha
  2  2  a  2    ali
  3  3  a  3  ahmed
b 1  4  b  1   moni
  2  5  b  2  baber

In [101]:
#how to reset index
data.reset_index()

   index  a  b  c      d
0      0  1  a  1  talha
1      1  2  a  2    ali
2      2  3  a  3  ahmed
3      3  4  b  1   moni
4      4  5  b  2  baber

# Combining and Merging Datasets not completed

In [48]:
import pandas as pd
import numpy as np

data1 = pd.DataFrame(np.random.randn(4*4).reshape(4,4),
                  columns = ['a','b','c','d'])
print(data1)
data2 = pd.DataFrame(np.random.randn(4*4).reshape(4,4), 
                     columns= ['a','d','e','f'])
data2

          a         b         c         d
0  1.168456  1.285963  0.375081 -1.364558
1  0.244700  0.619513 -0.669627  1.299525
2  0.097807 -1.698491 -1.096593 -0.555627
3 -0.707783  0.116778 -1.263692  1.007022

          a         d         e         f
0  0.326473 -2.101053 -0.182550  1.072314
1  0.842311 -0.751388 -0.810284  0.461627
2 -0.935628 -2.944658  0.897861 -0.143160
3  0.472317 -1.410807  0.114056  0.016088

In [51]:
df = pd.merge(data1, data2, on = 'a')

In [52]:
df

Empty DataFrame
Columns: [a, b, c, d_x, d_y, e, f]
Index: []

In [69]:
data1 = pd.DataFrame({'id': [ 1,2,3,4,],
                     'class': [9,10,11,12]})
display(data1)
data2 = pd.DataFrame({'id': [1,2,3,4],
                     'name': ['ali', 'ahmed', 'talha', 'nomi']})
display(data2)

   id  class
0   1      9
1   2     10
2   3     11
3   4     12

   id   name
0   1    ali
1   2  ahmed
2   3  talha
3   4   nomi

In [70]:
df = pd.merge(data1, data2, on = 'id')
df

   id  class   name
0   1      9    ali
1   2     10  ahmed
2   3     11  talha
3   4     12   nomi

In [71]:
df = pd.merge(data2, data1, on = 'id')
df

   id   name  class
0   1    ali      9
1   2  ahmed     10
2   3  talha     11
3   4   nomi     12

In [72]:
# if columns are not same
data1 = pd.DataFrame({'id': [ 1,2,3,5,],
                     'class': [9,10,11,12]})
display(data1)
data2 = pd.DataFrame({'id': [1,2,3,4],
                     'name': ['ali', 'ahmed', 'talha', 'nomi']})
display(data2)
df = pd.merge(data2, data1, on = 'id')
df

   id  class
0   1      9
1   2     10
2   3     11
3   5     12

   id   name
0   1    ali
1   2  ahmed
2   3  talha
3   4   nomi

   id   name  class
0   1    ali      9
1   2  ahmed     10
2   3  talha     11

In [83]:
df = pd.merge(data2, data1, on = 'id', how = 'left')
print(df)
print()
df = pd.merge(data2, data1, on = 'id', how = 'right')
print(df)
print()
df = pd.merge(data2, data1, on = 'id', how = 'outer', indicator = True)
print(df)

   id   name  class
0   1    ali    9.0
1   2  ahmed   10.0
2   3  talha   11.0
3   4   nomi    NaN

   id   name  class
0   1    ali      9
1   2  ahmed     10
2   3  talha     11
3   5    NaN     12

   id   name  class      _merge
0   1    ali    9.0        both
1   2  ahmed   10.0        both
2   3  talha   11.0        both
3   4   nomi    NaN   left_only
4   5    NaN   12.0  right_only

In [84]:
# if columns are totaly different
data1 = pd.DataFrame({'id': [ 1,2,3,4,],
                     'class': [9,10,11,12]})
display(data1)
data2 = pd.DataFrame({'id': [5,6,7,8],
                     'name': ['ali', 'ahmed', 'talha', 'nomi']})
display(data2)
df = pd.merge(data2, data1, left_index=True, right_index=True)
df

   id  class
0   1      9
1   2     10
2   3     11
3   4     12

   id   name
0   5    ali
1   6  ahmed
2   7  talha
3   8   nomi

   id_x   name  id_y  class
0     5    ali     1      9
1     6  ahmed     2     10
2     7  talha     3     11
3     8   nomi     4     12

In [88]:
# use of suffixes
ata1 = pd.DataFrame({'id': [ 1,2,3,4,],
                     'class': [9,10,11,12]})
display(data1)
data2 = pd.DataFrame({'id': [1,2,3,4],
                     'class': ['ali', 'ahmed', 'talha', 'nomi']})
display(data2)
df = pd.merge(data2, data1,on = 'id')
df

   id  class
0   1      9
1   2     10
2   3     11
3   4     12

   id  class
0   1    ali
1   2  ahmed
2   3  talha
3   4   nomi

   id class_x  class_y
0   1     ali        9
1   2   ahmed       10
2   3   talha       11
3   4    nomi       12

In [90]:
df = pd.merge(data2, data1,on = 'id', suffixes = ('_first', ('_sec')))
df

   id class_first  class_sec
0   1         ali          9
1   2       ahmed         10
2   3       talha         11
3   4        nomi         12

# Concatenating Along an Axis

In [32]:
# concatination #binding #sticking

In [ ]:
import pandas as pd
import numpy as np

data = pd.DataFrame(np.arange(4*4).reshape(4,4),
                  columns = ['a','b','c','d'])
print(data)
data2 = pd.DataFrame({'a':[1,2,3,4,5],
                     'b':['a','a','a','b','b'],
                    'c':[1,2,3,1,2],
                     'd':['talha','ali','ahmed','moni','baber']})
print(data2)
data3 = pd.DataFrame(np.random.randn(4*4).reshape(4,4), 
                     columns= ['a','b','c','d'])
data3

In [38]:
#by default it take axis = 0
new  = pd.concat([data, data2, data3])

In [39]:
display(new)
new  = pd.concat([data, data2, data3], axis = 1)
display(new)

           a           b          c         d
0   0.000000           1   2.000000         3
1   4.000000           5   6.000000         7
2   8.000000           9  10.000000        11
3  12.000000          13  14.000000        15
0   1.000000           a   1.000000     talha
1   2.000000           a   2.000000       ali
2   3.000000           a   3.000000     ahmed
3   4.000000           b   1.000000      moni
4   5.000000           b   2.000000     baber
0  -0.533628  0.00697229   1.123535   1.54395
1  -1.861076    0.769453  -0.229069  0.376059
2   0.477995    -1.02337  -0.434920  0.290598
3   0.708960    0.323683  -1.267886  -1.35075

,a,b,c,d,a,b,c,d,a,b,c,d
0,0.0,1.0,2.0,3.0,1,a,1,talha,-0.533628,0.006972,1.123535,1.543949
1,4.0,5.0,6.0,7.0,2,a,2,ali,-1.861076,0.769453,-0.229069,0.376059
2,8.0,9.0,10.0,11.0,3,a,3,ahmed,0.477995,-1.023365,-0.434920,0.290598
3,12.0,13.0,14.0,15.0,4,b,1,moni,0.708960,0.323683,-1.267886,-1.350746
4,NaN,NaN,NaN,NaN,5,b,2,baber,NaN,NaN,NaN,NaN